'use-strict';

// Наречия

// показателни
const indicativeAdverbs = ['сега', 'тогава', 'така', 'иначе', 'тук', 'тука', 'там', 'толкова', 'затова', 'насам', 'натам'];

// въпросителни
const questionableAdverbs = ['кога', 'как', 'къде', 'колко', 'защо', 'накъде', 'закъде', 'откъде'];

// относителни
const relativeAdverbs = ['когато', 'както', 'където', 'колкото', 'защото', 'закъдето', 'откъдето', 'накъдето'];

// неопределени
const notDistinctiveAdverbs = ['някога', 'някак', 'някъде', 'няколко', 'нанякъде'];

// отрицателни
const negativeAdverbs = ['никога', 'никак', 'никъде', 'николко', 'наникъде'];

// обобщителни
const summarizingАdverbs = ['всякога', 'всякак', 'всякъде', 'всяколко', 'навсякъде'];

// Наречия за количество
const quantityAdverbs = [
    'нищожно',
    'пренебрежително',
    'малко', 
    'средно', 
    'много',
    'обилно',
];

// за логичесто уточняване
const logicalRefinementAdverbs = [
    'благодарение',
    'вече',
    'въобще',
    'впрочем',
    'дали',
    'дано',
    'демек',
    'задето',
    'затова',
    'затуй',
    'инак',
    'иначе',
    'може',
    'нищо',
    'навярно',
    'наглед',
    'нагледно',
    'наистина',
    'няма',
    'някъде',
    'обаче',
    'очебийно',
    'очевидно',
    'още',
    'относно',
    'пак',
    'подир',
    'подире',
    'подред',
    'прочие',
    'предвид',
    'при',
    'понеже',
    'поне',
    'пъти',
    'посредством',
    'равносилно',
    'само',
    'сигурно',
    'стига',
    'съвсем',
    'състои',
    'сякаш',
    'така',
    'там',
    'твърде',
    'тогава',
    'току',
    'толкова',
    'толкоз',
    'тъй',
    'явно'
];

const adverbs = [].concat(
    indicativeAdverbs,
    questionableAdverbs,
    relativeAdverbs,
    notDistinctiveAdverbs,
    negativeAdverbs,
    summarizingАdverbs,
    quantityAdverbs,
    logicalRefinementAdverbs
);

// Частица
const particles = [
    'а', 'але', 'ама', 'ами', 'анджак', 'аха',
    'ба', 'бе', 'беки', 'белки', 'белким', 'би', 'божем', 'бозна', 'бре', 'брей',
    'волю', 'врели',
    'гаче', 'гиди', 'годе',
    'да', 'даже', 'дори',
    'еди', 'ей', 'ето',
    'зер',
    'и',
    'именно',
    'кешки', 'ки',
    'ле', 'леле', 'ли',
    'ма', 'май', 'мари', 'ми', 'мигар', 'мори', 'му',
    'на', 'надали', 'най', 'нали', 'например', 'не', 'неволю', 'невям', 'негли', 'недей', 'нейсе', 'нека', 'некипели', 'немай', 'нещяло', 'ни', 'нима', 'нито',
    'о', 'ой',
    'па', 'по', 'пък',
    'санким', 'се', 'си', 'сиреч',
    'те', 'ти', 'тоест',
    'уж', 'ужким',
    'ха', 'хай', 'хайде', 'хе', 'хей', 'хем', 'хи', 'хий', 'хич', 'холан',
    'чак', 'че', 'чунким',
    'ще', 'що', 'щяло',
    'я'
];

// Съюзи

// съчинителни
const computationalConjunctions = ['а', 'ако', 'ала', 'ама', 'ами', 'да', 'дето', 'и', 'или', 'като', 'ни', 'нито', 'но', 'па', 'пък', 'та', 'то', 'ту', 'хем', 'че'];

// подчинителни
const subordinateConjunctions = ['че', 'за', 'да', 'без', 'който', 'какъвто', 'чийто', 'когато', 'докато', 'щом', 'където', 'както', 'като', 'защото', 'понеже', 'затова', 'ако', 'колкото', 'освен', 'само', 'така', 'макар', 'въпреки', 'камо', 'ли'];

const conjunctions = [].concat(
    computationalConjunctions,
    subordinateConjunctions
);

// Междуметия
const interjections = [
    'ай', 'ало', 'апропо', 'ах', 'аха',
    'бау', 'благодаря', 'боже', 'божичко',
    'варда', 'вардааа', 'всуе',
    'гол',
    'джав', 'дий', 'довиждане', 'дум', 'думба',
    'еврика', 'ех',
    'здравей', 'здравейте', 'здрасти', 'знам',
    'кръгом', 'куку', 'кукуригу', 'кюта',
    'лумба',
    'майчице', 'мерси', 'мила', 'минтири', 'млък', 'моля', 'момко', 'мушу', 'мър', 'наздраве', 'нани',
    'оле', 'олеле', 'ох',
    'пардон', 'пата', 'пляс', 'пуф', 'пух', 'пфу',
    'разгеле',
    'сакън', 'сполай', 'супер',
    'так', 'тик', 'тинтири', 'трак', 'тряс', 'туп',
    'уви', 'ура', 'уф', 'ух',
    'хи', 'хм', 'хоп',
    'цап',
    'чао', 'чук',
    'шляп', 'шушу', 'щрак',
    'язък'
];

// Местоимения

// лични
const personalPropouns = [
    'аз', 'ти', 'той', 'тя', 'то', 'ние', 'ний', 'вие', 'вий', 'те', // именителен
    'мен', 'мене', 'ме', 'теб', 'тебе', 'те', 'него', 'го', 'нас', 'ни', 'вас', 'ви', 'тях', 'ги', // винителен
    'мене', 'ми', 'тебе', 'ти', 'нему', 'му', 'ней', 'ѝ', 'нему', 'му', 'нам', 'ни', 'вам', 'ви', 'им' // дателен
];

// притежателни
const possessivePronouns = [
    'мой', 'твой', 'негов', 'неин', 'негов', 'наш', 'ваш', 'техен', // м.р. неопр.
    'моят', 'моя', 'твоят', 'твоя', 'неговият', 'неговия', 'нейният', 'нейния', 'неговият', 'неговия', 'нашият', 'нашия', 'вашият', 'вашия', 'техният', 'техния', // м.р. определено
    'моя', 'твоя', 'негова', 'нейна', 'негова', 'наша', 'ваша', 'тяхна', // ж.р. неопр.
    'моята', 'твоята', 'неговата', 'нейната', 'неговата', 'нашата', 'вашата', 'тяхната', // ж.р. определено
    'мое', 'твое', 'негово', 'нейно', 'негово', 'наше', 'ваше', 'тяхно', // ср.р. неопр.
    'моето', 'твоето', 'неговото', 'нейното', 'неговото', 'нашето', 'вашето', 'тяхното',  // ср.р. определено
    'мои', 'твои', 'негови', 'нейни', 'негови', 'наши', 'ваши', 'техни', // мн.ч. неопр.
    'моите', 'твоите', 'неговите', 'нейните', 'неговите', 'нашите', 'вашите', 'техните', // мн.ч. определено
];

// възвратни
const reversePronouns = ['себе', 'се', 'свой', 'своят', 'своя', 'своята', 'свое', 'своето', 'свои', 'своите', 'си'];

// показателни
const indicativePronouns = [
    'този', 'тоя', 'озни', 'оня', 'такъв', 'онакъв', // м.р.
    'тази', 'тая', 'онази', 'оная', 'такава', 'онакава', // ж.р.
    'това', 'туй', 'онова', 'онуй', 'такова', 'онакова', // ср.р.
    'тези', 'тия', 'онези', 'ония', 'такива', 'онакива', // мн.ч.
];

// въпросителни
const questionablePronouns = [
    'кой', 'кого', 'кому', 'чий', 'какъв', // м.р.
    'коя', 'кого', 'кому', 'тия', 'каква', // ж.р.
    'кое', 'кого', 'кому', 'чуе', 'какво', // ср.р.
    'кои', 'кого', 'кому', 'чии', 'какви', // мн.ч.
    'колко'
];

// относителни
const relativePronouns = [
    'който', 'когото', 'комуто', 'чийто', 'какъвто', // м.р.
    'която', 'която', 'комуто', 'тиято', 'каквато', // ж.р.
    'което', 'което', 'комуто', 'чуето', 'каквото', // ср.р.
    'които', 'които', 'комуто', 'чиито', 'каквито', // мн.ч.
    'колкото'
];

// неопределени
const notDistinctivePronouns = [
    'някой', 'нечий', 'някакъв', // м.р.
    'някоя', 'нечия', 'някаква', // ж.р.
    'някое', 'нещо', 'нечие', 'някакво', // ср.р.
    'някои', 'нечии', 'някакви', // мн.ч.
    'няколко'
];

// отрицателни
const negativePronouns = [
    'никой', 'нищо', 'никого', 'никому', 'ничий', 'никакъв', // м.р.
    'никоя', 'ничия', 'никаква', // ж.р.
    'никое', 'ничие', 'никакво', // ср.р.
    'никои', 'ничии', 'никакви', // мн.ч.
    'николко'
];

// обобщителни
const summarizingPronouns = [
    'всеки', 'всякакъв', 'всичкият', // м.р.
    'всяка', 'всякаква', 'всичката', // ж.р.
    'всяко', 'всякакво', 'всичко', 'всичкото', // ср.р.
    'всички', 'всякакви', 'всички', 'всичките' // мн.ч.
];

const pronouns = [].concat(
    personalPropouns,
    possessivePronouns,
    reversePronouns,
    indicativePronouns,
    questionablePronouns,
    relativePronouns,
    notDistinctivePronouns,
    negativePronouns,
    summarizingPronouns
);

// Предлози - тип 192
const prepositions = [
    'без',
    'в', 'вдън', 'вместо', 'во', 'връз', 'всред', 'във', 'въз', 'въпреки', 'върху',
    'до', 'додето', 'докъм', 'допреди', 'досред',
    'за', 'зад', 'заради',
    'из', 'извън', 'иззад', 'измежду', 'изпод', 'изсред',
    'като', 'край', 'към',
    'между',
    'на', 'над', 'накрай', 'наместо', 'наоколо', 'насред', 'низ',
    'о', 'около', 'освен', 'от', 'открай', 'откъм', 'отсам', 'оттатък',
    'под', 'покрай', 'помежду', 'поради', 'посред', 'пред', 'преди', 'през', 'при', 'против', 'пряко',
    'с', 'свръх', 'след', 'според', 'спроти', 'спрямо', 'сред', 'срещу', 'със',
    'у',
    'чрез'
];

// Спомагателни глаголи
const auxiliaryVerbs = [
    'съм', 'си', 'е', 'сме', 'сте', 'са',
    'бях', 'бе', 'беше', 'бяхме', 'бяхте', 'бяха',
    'бих', 'биха', 'бихме', 'бихте',
    'би', 'бил', 'била', 'било', 'били',
    'ще', 'щях', 'щеше', 'щяха', 'щяхме', 'щяхте', 'щял', 'щяла', 'щяло', 'щели',
    'бъда', 'бъдеш', 'бъде', 'бъдат', 'бъдете'
];

const politeWords = [
    'здравей', 'здравейте', 'привет',
    'моля', 'молим', 'благодаря', 'благодарим',
    'бих', 'желал',
    'съжалявам', 'извинете', 'извинявай', 'извинявайте', 'простете',
    'довиждане', 'дочуване', 'чао',
];

const numericalWords = [
    /* 0    */ 'нула', 'нулата', 'нули', 'нулите',
    /* 1    */ 'един', 'единия', 'единият', 'една', 'едната', 'едно', 'едното', 'едни', 'едните',
    /* 2    */ 'два', 'двата', 'две', 'двете', 'две', 'двете', 'двама', 'двамата',
    /* 3    */ 'три', 'трите', 'трима', 'тримата',
    /* 4    */ 'четири', 'четирите', 'четирите', 'четирима', 'четиримата',
    /* 5    */ 'пет', 'петте', 'петима', 'петимата',
    /* 6    */ 'шест', 'шестте', 'шестима', 'шестимата',
    /* 7    */ 'седем', 'седемте', 'седмина', 'седмината',
    /* 8    */ 'осем', 'осемте', 'осмина', 'осмината',
    /* 9    */ 'девет', 'деветте', 'деветима', 'деветимата',
    /* 10   */ 'десет', 'десетте', 'десетима', 'десетимата', 'десетина', 'десетината',
    /* 11   */ 'единайсет', 'единайсетте', 'единайсетима', 'единайсетимата', 'единайсетина', 'единайсетината',
    /* 11   */ 'единадесет', 'единадесетте', 'единадесетима', 'единадесетимата', 'единадесетина', 'единадесетината',
    /* 12   */ 'дванайсет', 'дванайсетте', 'дванайсетима', 'дванайсетимата', 'дванайсетина', 'дванайсетината',
    /* 12   */ 'дванадесет', 'дванадесетте', 'дванадесетима', 'дванадесетимата', 'дванадесетина', 'дванадесетината',
    /* 13   */ 'тринадесет', 'тринадесетте', 'тринадесетима', 'тринадесетимата', 'тринадесетина', 'тринадесетината',
    /* 13   */ 'тринайсет', 'тринайсетте', 'тринайсетима', 'тринайсетимата', 'тринайсетина', 'тринайсетината',
    /* 14   */ 'четиринадесет', 'четиринадесетте', 'четиринадесетима', 'четиринадесетимата', 'четиринадесетина', 'четиринадесетината',
    /* 14   */ 'четиринайсет', 'четиринайсетте', 'четиринайсетима', 'четиринайсетимата', 'четиринайсетина', 'четиринайсетината',
    /* 15   */ 'петнадесет', 'петнадесетте', 'петнадесетима', 'петнадесетимата', 'петнадесетина', 'петнадесетината',
    /* 15   */ 'петнайсет', 'петнайсетте', 'петнайсетима', 'петнайсетимата', 'петнайсетина', 'петнайсетината',
    /* 16   */ 'шестнадесет', 'шестнадесетте', 'шестнадесетима', 'шестнадесетимата', 'шестнадесетина', 'шестнадесетината',
    /* 16   */ 'шестнайсет', 'шестнайсетте', 'шестнайсетима', 'шестнайсетимата', 'шестнайсетина', 'шестнайсетината',
    /* 17   */ 'седемнадесет', 'седемнадесетте', 'седемнадесетима', 'седемнадесетимата', 'седемнадесетина', 'седемнадесетината',
    /* 17   */ 'седемнайсет', 'седемнайсетте', 'седемнайсетима', 'седемнайсетимата', 'седемнайсетина', 'седемнайсетината',
    /* 18   */ 'осемнадесет', 'осемнадесетте', 'осемнадесетима', 'осемнадесетимата', 'осемнадесетина', 'осемнадесетината',
    /* 18   */ 'осемнайсет', 'осемнайсетте', 'осемнайсетима', 'осемнайсетимата', 'осемнайсетина', 'осемнайсетината',
    /* 19   */ 'деветнадесет', 'деветнадесетте', 'деветнадесетима', 'деветнадесетимата', 'деветнадесетина', 'деветнадесетината',
    /* 19   */ 'деветнайсет', 'деветнайсетте', 'деветнайсетима', 'деветнайсетимата', 'деветнайсетина', 'деветнайсетината',
    /* 20   */ 'двадесет', 'двадесетте', 'двадесетима', 'двадесетимата', 'двадесетина', 'двадесетината',
    /* 20   */ 'двайсет', 'двайсетте', 'двайсетима', 'двайсетимата', 'двайсетина', 'двайсетината',
    /* 30   */ 'тридесет', 'тридесетте', 'тридесетима', 'тридесетимата', 'тридесетина', 'тридесетината',
    /* 30   */ 'трийсет', 'трийсетте', 'трийсетима', 'трийсетимата', 'трийсетина', 'трийсетината',
    /* 40   */ 'четиридесет', 'четиридесетте', 'четиридесетима', 'четиридесетимата', 'четиридесетина', 'четиридесетината',
    /* 40   */ 'четиресет', 'четиресетте', 'четиресетима', 'четиресетимата', 'четиресетина', 'четиресетината',
    /* 50   */ 'петдесет', 'петдесетте', 'петдесетима', 'петдесетимата', 'петдесетина', 'петдесетината',
    /* 60   */ 'шейсет', 'шейсетте', 'шейсетима', 'шейсетимата', 'шейсетина', 'шейсетината',
    /* 60   */ 'шестдесет', 'шестдесетте', 'шестдесетима', 'шестдесетимата', 'шестдесетина', 'шестдесетината',
    /* 70   */ 'седемдесет', 'седемдесетте', 'седемдесетима', 'седемдесетимата', 'седемдесетина', 'седемдесетината',
    /* 80   */ 'осемдесет', 'осемдесетте', 'осемдесетима', 'осемдесетимата', 'осемдесетина', 'осемдесетината',
    /* 90   */ 'деведесет', 'деведесетте', 'деведесетима', 'деведесетимата', 'деведесетина', 'деведесетината',
    /* 100  */ 'сто', 'стоте', 'стотина', 'стотината',
    /* 200  */ 'двеста', 'двестате', 'двестатина', 'двестатината',
    /* 300  */ 'триста', 'тристате', 'тристатина', 'тристатината',
    /* 400  */ 'четиристотин', 'четиристотинте', 'четиристотина', 'четиристотината',
    /* 500  */ 'петстотин', 'петстотинте', 'петстотина', 'петстотината',
    /* 600  */ 'шестстотин', 'шестстотинте', 'шестстотина', 'шестстотината',
    /* 700  */ 'седемстотин', 'седемстотинте', 'седемстотина', 'седемстотината',
    /* 800  */ 'осемстотин', 'осемстотинте', 'осемстотина', 'осемстотината',
    /* 900  */ 'деветстотин', 'деветстотинте', 'деветстотина', 'деветстотината',
    /* 1000 */ 'хиляда', 'хилядата', 'хиляди', 'хилядите',
    /* млм  */ 'милион', 'милиона', 'милионът', 'милиони', 'милионите',
    /* млд  */ 'милиард', 'милиарда', 'милиардът', 'милиарди', 'милиардите',
    /* трл  */ 'трилион', 'трилиона', 'трилионът', 'трилиони', 'трилионите',
    /* ∞    */ 'безброй', 'безброя', 'безброят', 'безброите',
    /* ∞    */ 'безкрай', 'безкрая', 'безкраят'
];

const numericalAdjectives = [
    /* 0    */ 'нулев', 'нулевия', 'нулевият', 'нулева', 'нулевата', 'нулево', 'нулевото', 'нулеви', 'нулевите',
    /* 1    */ 'пръв', 'първи', 'първия', 'първият', 'първа', 'първата', 'първо', 'първото', 'първите',
    /* 2    */ 'втори', 'втория', 'вторият', 'втора', 'втората', 'второ', 'второто',
    /* 3    */ 'трети', 'третия', 'третият', 'трета', 'третата', 'трето', 'третото', 'третите',
    /* 4    */ 'четвърти', 'четвъртия', 'четвъртият', 'четвърта', 'четвъртата', 'четвърто', 'четвъртото', 'четвъртите',
    /* 5    */ 'пети', 'петия', 'петят', 'пета', 'петата', 'пето', 'петото', 'петите',
    /* 6    */ 'шести', 'шестия', 'шестят', 'шеста', 'шестата', 'шесто', 'шестото', 'шестите',
    /* 7    */ 'седми', 'седмия', 'седмият', 'седма', 'седмата', 'седмо', 'седмото', 'седмите',
    /* 8    */ 'осми', 'осмия', 'осмият', 'осма', 'осмата', 'осмо', 'осмото', 'осмите',
    /* 9    */ 'девети', 'деветия', 'деветият', 'девета', 'деветата', 'девето', 'деветото', 'деветите',
    /* 10   */ 'десети', 'десетия', 'десетят', 'десета', 'десетата', 'десето', 'десетото', 'десетите',
    /* 11   */ 'единадесети', 'единадесетия', 'единадесетят', 'единадесета', 'единадесетата', 'единадесето', 'единадесетото', 'единадесетите',
    /* 11   */ 'единайсети', 'единайсетия', 'единайсетият', 'единайсета', 'единайсетата', 'единайсето', 'единайсетото', 'единайсетите',
    /* 12   */ 'дванадесети', 'дванадесетия', 'дванадесетят', 'дванадесета', 'дванадесетата', 'дванадесето', 'дванадесетото', 'дванадесетите',
    /* 12   */ 'дванайесети', 'дванайесетия', 'дванайесетият', 'дванайесета', 'дванайесетата', 'дванайесето', 'дванайесетото', 'дванайесетите',
    /* 12   */ 'дванадесети', 'дванадесетия', 'дванадесетият', 'дванадесета', 'дванадесетата', 'дванадесето', 'дванадесетото', 'дванадесетите',
    /* 12   */ 'дванайсти', 'дванайстия', 'дванайстият', 'дванайста', 'дванайстата', 'дванайсто', 'дванайстото', 'дванайстите',
    /* 13   */ 'тринадесети', 'тринадесетия', 'тринадесетият', 'тринадесета', 'тринадесетата', 'тринадесето', 'тринадесетото', 'тринадесетите',
    /* 13   */ 'тринайсети', 'тринайсетия', 'тринайсетият', 'тринайсета', 'тринайсетата', 'тринайсето', 'тринайсетото', 'тринайсетите',
    /* 14   */ 'четиринадесети', 'четиринадесетия', 'четиринадесетият', 'четиринадесета', 'четиринадесетата', 'четиринадесето', 'четиринадесетото', 'четиринадесетите',
    /* 14   */ 'четиринайсети', 'четиринайсетия', 'четиринайсетият', 'четиринайсета', 'четиринайсетата', 'четиринайсето', 'четиринайсетото', 'четиринайсетите',
    /* 15   */ 'петнадесети', 'петнадесетия', 'петнадесетият', 'петнадесета', 'петнадесетата', 'петнадесето', 'петнадесетото', 'петнадесетите',
    /* 15   */ 'петнайсети', 'петнайсетия', 'петнайсетият', 'петнайсета', 'петнайсетата', 'петнайсето', 'петнайсетото', 'петнайсетите',
    /* 16   */ 'шестнадесети', 'шестнадесетия', 'шестнадесетият', 'шестнадесета', 'шестнадесетата', 'шестнадесето', 'шестнадесетото', 'шестнадесетите',
    /* 16   */ 'шестнайсети', 'шестнайсетия', 'шестнайсетият', 'шестнайсета', 'шестнайсетата', 'шестнайсето', 'шестнайсетото', 'шестнайсетите',
    /* 17   */ 'седемнадесети', 'седемнадесетия', 'седемнадесетият', 'седемнадесета', 'седемнадесетата', 'седемнадесето', 'седемнадесетото', 'седемнадесетите',
    /* 17   */ 'седемнайсети', 'седемнайсетия', 'седемнайсетият', 'седемнайсета', 'седемнайсетата', 'седемнайсето', 'седемнайсетото', 'седемнайсетите',
    /* 18   */ 'осемнадесети', 'осемнадесетия', 'осемнадесетият', 'осемнадесета', 'осемнадесетата', 'осемнадесето', 'осемнадесетото', 'осемнадесетите',
    /* 18   */ 'осемнайсети', 'осемнайсетия', 'осемнайсетият', 'осемнайсета', 'осемнайсетата', 'осемнайсето', 'осемнайсетото', 'осемнайсетите',
    /* 19   */ 'деветнадесети', 'деветнадесетия', 'деветнадесетият', 'деветнадесета', 'деветнадесетата', 'деветнадесето', 'деветнадесетото', 'идеветнадесетите',
    /* 19   */ 'деветнайсети', 'деветнайсетия', 'деветнайсетият', 'деветнайсета', 'деветнайсетата', 'деветнайсето', 'деветнайсетото', 'деветнайсетите',
    /* 20   */ 'двадесети', 'двадесетия', 'двадесетият', 'двадесета', 'двадесетата', 'двадесето', 'двадесетото', 'двадесетите',
    /* 20   */ 'двайсти', 'двайстия', 'двайстият', 'двайста', 'двайстата', 'двайсто', 'двайстото', 'двайстите',
    /* 30   */ 'тридесети', 'тридесетия', 'тридесетят', 'тридесета', 'тридесетата', 'тридесето', 'тридесетото', 'тридесетите',
    /* 30   */ 'трийсети', 'трийсетия', 'трийсетят', 'трийсета', 'трийсетата', 'трийсето', 'трийсетото', 'трийсетите',
    /* 40   */ 'четиридесети', 'четиридесетия', 'четиридесетият', 'четиридесета', 'четиридесетата', 'четиридесето', 'четиридесетото', 'четиридесетите',
    /* 40   */ 'четирийсети', 'четирийсетия', 'четирийсетият', 'четирийсета', 'четирийсетата', 'четирийсето', 'четирийсетото', 'четирийсетите',
    /* 50   */ 'петдесети', 'петдесетия', 'петдесетият', 'петдесета', 'петдесетата', 'петдесето', 'петдесетото', 'петдесетите',
    /* 60   */ 'шестдесети', 'шестдесетия', 'шестдесетият', 'шестдесета', 'шестдесетата', 'шестдесето', 'шестдесетото', 'шестдесетите',
    /* 60   */ 'шейсети', 'шейсетия', 'шейсетият', 'шейсета', 'шейсетата', 'шейсето', 'шейсетото', 'шейсетите',
    /* 70   */ 'седемдесети', 'седемдесетия', 'седемдесетият', 'седемдесета', 'седемдесетата', 'седемдесето', 'седемдесетото', 'седемдесетите',
    /* 80   */ 'осемдесети', 'осемдесетия', 'осемдесетият', 'осемдесета', 'осемдесетата', 'осемдесето', 'осемдесетото', 'осемдесетите',
    /* 90   */ 'деветдесети', 'деветдесетия', 'деветдесетият', 'деветдесета', 'деветдесетата', 'деветдесето', 'деветдесетото', 'деветдесетите',
    /* 100  */ 'стотен', 'стотния', 'стотният', 'стотна', 'стотната', 'стотно', 'стотното', 'стотни', 'стотните',
    /* 1000 */ 'хиляден', 'хилядния', 'хилядният', 'хилядна', 'хилядната', 'хилядно', 'хилядното', 'хилядни', 'хилядните',
    /* млн  */ 'милионен', 'милионния', 'милионният', 'милионна', 'милионната', 'милионно', 'милионното', 'милионни', 'милионните',
    /* млд  */ 'милиарден', 'милиардния', 'милиардният', 'милиардна', 'милиардната', 'милиардно', 'милиардното', 'милиардните',
    /* ∞    */ 'безброен', 'безбройния', 'безбройният', 'безбройна', 'безбройната', 'безбройно', 'безбройното', 'безбройни', 'безбройните',
    /* ∞    */ 'безкраен', 'безкрайния', 'безкрайният', 'безкрайна', 'безкрайната', 'безкрайно', 'безкрайното', 'безкрайни', 'безкрайните'
];

let allCommon = [].concat(
    adverbs,
    particles,
    conjunctions,
    interjections,
    pronouns,
    prepositions,
    auxiliaryVerbs,
    politeWords,
    numericalWords,
    numericalAdjectives
);

// Remove duplicates
allCommon = allCommon.filter((word, pos) => allCommon.indexOf(word) === pos);

module.exports = allCommon;